app/Controllers/Api/ApplicationController.php

    public function update($id = null)
    {
        $application = $this->model->find($id);

        if (!$application) {
            return $this->failNotFound('Application not found');
        }

        $data = $this->request->getJSON(true);
        $this->model->update($id, $data);
---
UPDATE `applications` SET `app_name` = 'Inventory System Updated', `description` = 'Updated description for inventory system', `updated_at` = '2026-05-06 04:55:49'
WHERE `applications`.`id` IN ('1')