app/Controllers/Api/AuthController.php

        }

        $data = $this->request->getJSON(true);
        $userId = $this->userModel->insert($data);
---
INSERT INTO `users` (`username`, `email`, `password`, `fullname`, `created_at`, `updated_at`) VALUES ('suluh', 'suluh@example.com', '$2y$10$enI3eSfMWiggqGc2ce/kk.jY2tTlQLxDnuHFOGdIs7PvIs4Jmfv42', 'System Administrator', '2026-05-06 04:42:16', '2026-05-06 04:42:16')

    public function login()
    {
        $rules = [
            'username' => 'required',
            'password' => 'required'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $this->userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'suluh'
 LIMIT 1

    private function assignDefaultAdminRole($userId)
    {
        $db = \Config\Database::connect();

        // Pastikan role admin exists
        $roleModel = new \App\Models\RoleModel();
        $adminRole = $roleModel->where('role_code', 'admin')->first();

        if (!$adminRole) {
            $roleId = $roleModel->insert([
                'role_name' => 'Administrator',
                'role_code' => 'admin',
                'description' => 'Super admin with full access'
            ]);
        } else {
            $roleId = $adminRole['id'];
        }

        // Assign role to user
        $db->table('user_roles')->insert([
            'user_id' => $userId,
            'role_id' => $roleId
        ]);
---
SELECT *
FROM `roles`
WHERE `role_code` = 'admin'
 LIMIT 1
INSERT INTO `roles` (`role_name`, `role_code`, `description`, `created_at`, `updated_at`) VALUES ('Administrator', 'admin', 'Super admin with full access', '2026-05-06 04:42:16', '2026-05-06 04:42:16')
INSERT INTO `user_roles` (`user_id`, `role_id`) VALUES (3, 1)