app/Controllers/Api/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'suluh'
 LIMIT 1
---
    public function login()
    {
        $rules = [
            'username' => 'required',
            'password' => 'required'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $this->userModel->getUserWithAvatar(
            $this->userModel->where('username', $username)->first()['id'] ?? null
        );