app/Controllers/Api/CdnController.php

INSERT INTO `cdn_files` (`file_name`, `original_name`, `file_path`, `file_type`, `file_extension`, `file_size`, `mime_type`, `checksum`, `folder`, `is_public`, `uploaded_by`, `created_at`, `updated_at`) VALUES ('WhatsAppImage2025-02-22at085356_01c708b6_69faecc54bf2e2.69876243.jpg', 'WhatsApp Image 2025-02-22 at 08.53.56_01c708b6.jpg', 'cdn/images/WhatsAppImage2025-02-22at085356_01c708b6_69faecc54bf2e2.69876243.jpg', 'image/jpeg', 'jpg', 21171, 'image/jpeg', '200fabdf0b39f9eb2b51954a51cf8023', '/images', 1, '3', '2026-05-06 07:24:53', '2026-05-06 07:24:53')
---
                'uploaded_by' => $this->request->user_id ?? null
            ];

            $fileId = $this->model->insert($fileData);