app/Controllers/Api/RolePermissionController.php

    public function setPermissions()
    {
        $rules = [
            'role_id' => 'required|integer',
            'permissions' => 'required'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $data = $this->request->getJSON(true);
        $roleId = $data['role_id'];
        $permissions = $data['permissions']; // Array of permissions

        // Hapus permission lama
        $db = \Config\Database::connect();
        $db->table('role_permissions')->where('role_id', $roleId)->delete();
---
DELETE FROM `role_permissions`
WHERE `role_id` = 2

    public function checkAccess($userId, $moduleCode, $action)
    {
        $db = \Config\Database::connect();

        $builder = $db->table('role_permissions');
        $builder->select('role_permissions.*');
        $builder->join('user_roles', 'user_roles.role_id = role_permissions.role_id');
        $builder->join('modules', 'modules.id = role_permissions.module_id');
        $builder->where('user_roles.user_id', $userId);
        $builder->where('modules.module_code', $moduleCode);

        $permissions = $builder->get()->getResultArray();
---
SELECT `role_permissions`.*
FROM `role_permissions`
JOIN `user_roles` ON `user_roles`.`role_id` = `role_permissions`.`role_id`
JOIN `modules` ON `modules`.`id` = `role_permissions`.`module_id`
WHERE `user_roles`.`user_id` = '1'
AND `modules`.`module_code` = 'products'