app/Controllers/Api/UserManagementController.php

    public function show($id = null)
    {
        $user = $this->userModel->find($id);

        if (!$user) {
            return $this->failNotFound('User not found');
        }

        $db = \Config\Database::connect();
        $builder = $db->table('user_roles');
        $builder->select('roles.*');
        $builder->join('roles', 'roles.id = user_roles.role_id');
        $builder->where('user_roles.user_id', $id);
        $roles = $builder->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'
SELECT `roles`.*
FROM `user_roles`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `user_roles`.`user_id` = '3'

    public function assignRole()
    {
        $rules = [
            'user_id' => 'required|integer',
            'role_id' => 'required|integer'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $data = $this->request->getJSON(true);

        $db = \Config\Database::connect();

        $exists = $db->table('user_roles')
                     ->where('user_id', $data['user_id'])
                     ->where('role_id', $data['role_id'])
                     ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user_roles`
WHERE `user_id` = 3
AND `role_id` = 1