app/Models/Inv/InvMaterialModel.php

SELECT *
FROM `inv_materials`
WHERE `material_code` LIKE 'WOO-RA%'
ORDER BY `id` DESC
 LIMIT 1
---
    public function generateCode($categoryCode, $materialType)
    {
        $prefix = strtoupper(substr($categoryCode, 0, 3));
        $typePrefix = strtoupper(substr($materialType, 0, 2));

        $lastMaterial = $this->where('material_code LIKE', $prefix . '-' . $typePrefix . '%')
                             ->orderBy('id', 'DESC')
                             ->first();