app/Models/Inv/InvSupplierModel.php

    public function getInternational()
    {
        return $this->where('supplier_type', 'international')
                    ->where('is_active', 1)
                    ->findAll();
---
SELECT *
FROM `inv_suppliers`
WHERE `supplier_type` = 'international'
AND `is_active` = 1

    public function getLocal()
    {
        return $this->where('supplier_type', 'local')
                    ->where('is_active', 1)
                    ->findAll();
---
SELECT *
FROM `inv_suppliers`
WHERE `supplier_type` = 'local'
AND `is_active` = 1

    public function getWithCurrency($id = null)
    {
        $builder = $this->select('inv_suppliers.*, inv_currencies.code as currency_code, inv_currencies.symbol as currency_symbol')
                        ->join('inv_currencies', 'inv_currencies.id = inv_suppliers.currency_id', 'left');

        if ($id) {
            return $builder->where('inv_suppliers.id', $id)->first();
        }

        return $builder->findAll();
---
SELECT `inv_suppliers`.*, `inv_currencies`.`code` as `currency_code`, `inv_currencies`.`symbol` as `currency_symbol`
FROM `inv_suppliers`
LEFT JOIN `inv_currencies` ON `inv_currencies`.`id` = `inv_suppliers`.`currency_id`