app/Models/CdnFileModel.php

    public function getFilesByFolder($folder = '/', $limit = 50, $offset = 0)
    {
        return $this->where('folder', $folder)
                    ->orderBy('created_at', 'DESC')
                    ->findAll($limit, $offset);
---
SELECT *
FROM `cdn_files`
WHERE `folder` = '/'
AND `cdn_files`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 20

    public function getStats()
    {
        $db = \Config\Database::connect();

        return [
            'total_files' => $this->countAll(),
            'total_size' => $this->selectSum('file_size')->first()['file_size'] ?? 0,
            'total_downloads' => $this->selectSum('download_count')->first()['download_count'] ?? 0,
            'by_type' => $db->table('cdn_files')
                            ->select('file_type, COUNT(*) as count, SUM(file_size) as total_size')
                            ->groupBy('file_type')
                            ->get()
                            ->getResultArray(),
            'by_extension' => $db->table('cdn_files')
                                ->select('file_extension, COUNT(*) as count')
                                ->groupBy('file_extension')
                                ->get()
                                ->getResultArray(),
        ];
---
SELECT COUNT(*) AS `numrows` FROM `cdn_files`
SELECT SUM(`file_size`) AS `file_size`
FROM `cdn_files`
WHERE `cdn_files`.`deleted_at` IS NULL
 LIMIT 1
SELECT SUM(`download_count`) AS `download_count`
FROM `cdn_files`
WHERE `cdn_files`.`deleted_at` IS NULL
 LIMIT 1
SELECT `file_type`, COUNT(*) as count, SUM(file_size) as total_size
FROM `cdn_files`
GROUP BY `file_type`
SELECT `file_extension`, COUNT(*) as count
FROM `cdn_files`
GROUP BY `file_extension`

    public function incrementDownloadCount($id)
    {
        return $this->where('id', $id)
                    ->set('download_count', 'download_count + 1', false)
                    ->update();
---
UPDATE `cdn_files` SET `download_count` = download_count + 1, `updated_at` = '2026-05-06 07:25:08'
WHERE `id` = '1'