app/Models/RolePermissionModel.php

    public function getPermissionsByRole($roleId)
    {
        return $this->select('role_permissions.*, applications.app_name, modules.module_name')
                    ->join('applications', 'applications.id = role_permissions.application_id')
                    ->join('modules', 'modules.id = role_permissions.module_id')
                    ->where('role_permissions.role_id', $roleId)
                    ->findAll();
---
SELECT `role_permissions`.*, `applications`.`app_name`, `modules`.`module_name`
FROM `role_permissions`
JOIN `applications` ON `applications`.`id` = `role_permissions`.`application_id`
JOIN `modules` ON `modules`.`id` = `role_permissions`.`module_id`
WHERE `role_permissions`.`role_id` = '3'