app/Models/UserModel.php

SELECT `users`.*, GROUP_CONCAT(roles.role_name) as roles
FROM `users`
LEFT JOIN `user_roles` ON `user_roles`.`user_id` = `users`.`id`
LEFT JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
GROUP BY `users`.`id`
---
    public function getUsersWithRoles()
    {
        return $this->select('users.*, GROUP_CONCAT(roles.role_name) as roles')
                    ->join('user_roles', 'user_roles.user_id = users.id', 'left')
                    ->join('roles', 'roles.id = user_roles.role_id', 'left')
                    ->groupBy('users.id')
                    ->findAll();

SELECT COUNT(*) AS `numrows` FROM `users`
---
    public function hasAnyUser(): bool
    {
        return $this->countAll() > 0;