app/Models/UserModel.php

    public function getUserWithAvatar($userId)
    {
        return $this->select('users.*, cdn_files.file_path as avatar_path, cdn_files.file_name as avatar_filename, cdn_files.file_size as avatar_size, cdn_files.mime_type as avatar_mime')
                    ->join('cdn_files', 'cdn_files.id = users.avatar_id', 'left')
                    ->where('users.id', $userId)
                    ->first();
---
SELECT `users`.*, `cdn_files`.`file_path` as `avatar_path`, `cdn_files`.`file_name` as `avatar_filename`, `cdn_files`.`file_size` as `avatar_size`, `cdn_files`.`mime_type` as `avatar_mime`
FROM `users`
LEFT JOIN `cdn_files` ON `cdn_files`.`id` = `users`.`avatar_id`
WHERE `users`.`id` = '3'
 LIMIT 1