app/Controllers/Api/Inv/InvMaterialController.php

SELECT COUNT(*) AS `numrows`
FROM `inv_materials`
JOIN `inv_material_categories` ON `inv_material_categories`.`id` = `inv_materials`.`category_id`
JOIN `inv_uom` ON `inv_uom`.`id` = `inv_materials`.`uom_id`
SELECT `inv_materials`.*, `inv_material_categories`.`category_name`, `inv_uom`.`uom_name`
FROM `inv_materials`
JOIN `inv_material_categories` ON `inv_material_categories`.`id` = `inv_materials`.`category_id`
JOIN `inv_uom` ON `inv_uom`.`id` = `inv_materials`.`uom_id`
ORDER BY `inv_materials`.`material_name` ASC
 LIMIT 20
---
    public function index()
    {
        $page = $this->request->getGet('page') ?? 1;
        $limit = $this->request->getGet('limit') ?? 50;
        $categoryId = $this->request->getGet('category_id');
        $materialType = $this->request->getGet('material_type');
        $search = $this->request->getGet('search');

        $builder = $this->model->select('inv_materials.*, inv_material_categories.category_name, inv_uom.uom_name')
                               ->join('inv_material_categories', 'inv_material_categories.id = inv_materials.category_id')
                               ->join('inv_uom', 'inv_uom.id = inv_materials.uom_id');

        if ($categoryId) {
            $builder->where('inv_materials.category_id', $categoryId);
        }

        if ($materialType) {
            $builder->where('inv_materials.material_type', $materialType);
        }

        if ($search) {
            $builder->groupStart()
                    ->like('inv_materials.material_code', $search)
                    ->orLike('inv_materials.material_name', $search)
                    ->groupEnd();
        }

        $total = $builder->countAllResults(false);
        $materials = $builder->orderBy('inv_materials.material_name', 'ASC')
                             ->findAll($limit, ($page - 1) * $limit);

SELECT *
FROM `inv_material_categories`
WHERE `inv_material_categories`.`id` = 2
INSERT INTO `inv_materials` (`material_name`, `category_id`, `material_type`, `uom_id`, `density`, `moisture_content`, `wood_grade`, `wood_species`, `min_stock`, `max_stock`, `lead_time_days`, `is_batch_tracked`, `requires_inspection`, `storage_condition`, `handling_instruction`, `material_code`, `created_at`, `updated_at`) VALUES ('Kayu Jati Solid Grade A', 2, 'raw_wood', 1, 720, 12, 'A', 'Teak', 5, 50, 30, 1, 1, 'Simpan di tempat kering, hindari kelembaban tinggi', 'Gunakan forklift untuk pengangkatan', 'WOO-RA-00001', '2026-05-06 10:08:02', '2026-05-06 10:08:02')
---
    public function create()
    {
        $rules = [
            'material_name' => 'required|min_length[3]',
            'category_id' => 'required|integer',
            'material_type' => 'required',
            'uom_id' => 'required|integer'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $data = $this->request->getJSON(true);

        // Generate material code
        $categoryModel = new \App\Models\Inv\InvMaterialCategoryModel();
        $category = $categoryModel->find($data['category_id']);
        $data['material_code'] = $this->model->generateCode($category['category_code'], $data['material_type']);

        $id = $this->model->insert($data);